---
kind: property
id: P:Autodesk.Revit.DB.ComponentRepeater.DimensionCount
source: html/c958b9ec-0aeb-d97f-0fcb-a0ecc58b9db6.htm
---
# Autodesk.Revit.DB.ComponentRepeater.DimensionCount Property

The dimension count of the component repeater.

## Syntax (C#)
```csharp
public int DimensionCount { get; }
```